# tap
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# lib
brew "1password-cli"
brew "cmake"
brew "ffmpeg"
brew "gettext"
brew "gnupg"
brew "gnutls"
brew "go"
brew "hub"
brew "imagemagick"
brew "libevent"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libyaml"
brew "node"
brew "pcre"
brew "readline"
brew "ruby-build"
brew "sqlite"
brew "tmux"
brew "vim"
brew "xz"
brew "zlib"

# cli
brew "git"
brew "jq"
brew "mas"
brew "pwgen"
brew "pyenv"
brew "python"
brew "python3"
brew "rbenv"
brew "telnet"
brew "the_silver_searcher"

# cask
cask "1password"
cask "alfred"
cask "caprine"
cask "chromedriver"
cask "disk-inventory-x"
cask "docker"
cask "google-backup-and-sync"
cask "flux"
cask "handbrake"
cask "hazel"
cask "iterm2"
cask "keepassxc"
cask "logitech-myharmony"
cask "macdown"
cask "makemkv"
cask "michaelvillar-timer"
cask "musaicfm"
cask "onyx"
cask "slack"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "vlc"
cask "whatsapp"

# mas
mas "GIF Keyboard", id: 1043270657
mas "iMovie", id: 408981434
mas "Microsoft To Do", id: 1274495053
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Twitterrific", id: 1289378661
mas "Xcode", id: 497799835
